swarnmani/fmtr/arm_cortex/example/NXP_LPC1114_MDK4.0/LPC111x_Lib/include/lpc11xx_uart.h
/********************************************************************//**
* @brief UART Full modem -  Signal states definition
**********************************************************************/
typedef enum {
	INACTIVE = 0,			/* In-active state */
	ACTIVE = !INACTIVE 		/* Active state */
}UART_SignalState;

/* Macro to check the input UART_SignalState parameters */
#define PARAM_UART_SIGNALSTATE(x) ((x==INACTIVE) || (x==ACTIVE))

/**
 * @brief UART modem status type definition
 */
typedef enum {
	UART_MODEM_STAT_DELTA_CTS	= UART_MSR_DELTA_CTS,		/*!< Set upon state change of input CTS */
	UART_MODEM_STAT_DELTA_DSR	= UART_MSR_DELTA_DSR,		/*!< Set upon state change of input DSR */
	UART_MODEM_STAT_LO2HI_RI	= UART_MSR_LO2HI_RI,		/*!< Set upon low to high transition of input RI */
	UART_MODEM_STAT_DELTA_DCD	= UART_MSR_DELTA_DCD,		/*!< Set upon state change of input DCD */
	UART_MODEM_STAT_CTS		= UART_MSR_CTS,			/*!< Clear To Send State */
	UART_MODEM_STAT_DSR		= UART_MSR_DSR,			/*!< Data Set Ready State */
	UART_MODEM_STAT_RI			= UART_MSR_RI,				/*!< Ring Indicator State */
	UART_MODEM_STAT_DCD		= UART_MSR_DCD				/*!< Data Carrier Detect State */
} UART_MODEM_STAT_type;

/**
 * @brief Modem output pin type definition
 */
typedef enum {
	UART_MODEM_PIN_DTR			= 0,		/*!< Source for modem output pin DTR */
	UART_MODEM_PIN_RTS						/*!< Source for modem output pin RTS */
} UART_MODEM_PIN_Type;

/** Macro to check the input PARAM_UART_MODEM_PIN parameters */
#define PARAM_UART_MODEM_PIN(x) ((x==UART_MODEM_PIN_DTR) || (x==UART_MODEM_PIN_RTS))


/**
 * @brief UART Modem mode type definition
 */
typedef enum {
	UART_MODEM_MODE_LOOPBACK	= 0,		/*!< Loop back mode select */
	UART_MODEM_MODE_AUTO_RTS,				/*!< Enable Auto RTS flow-control */
	UART_MODEM_MODE_AUTO_CTS 				/*!< Enable Auto CTS flow-control */
} UART_MODEM_MODE_Type;

/** Macro to check the input PARAM_UART_MODEM_MODE parameters */
#define PARAM_UART_MODEM_MODE(x) ((x==UART_MODEM_MODE_LOOPBACK) || (x==UART_MODEM_MODE_AUTO_RTS) \
								|| (x==UART_MODEM_MODE_AUTO_CTS))


/**
 * @brief UART Direction Control Pin type definition
 */
typedef enum {
	UART_RS485_DIRCTRL_RTS = 0,	/**< Pin RTS is used for direction control */
	UART_RS485_DIRCTRL_DTR			/**< Pin DTR is used for direction control */
} UART_RS485_DIRCTRL_PIN_Type;

/** Macro to check the direction control pin type */
#define PARAM_UART_RS485_DIRCTRL_PIN(x)	((x==UART_RS485_DIRCTRL_RTS) || (x==UART_RS485_DIRCTRL_DTR))


/********************************************************************//**
* @brief UART Configuration Structure definition
**********************************************************************/
typedef struct {
  uint32_t Baud_rate;   		/**< UART baud rate */

  UART_PARITY_Type Parity;    	/**< Parity selection, should be:
							   - UART_PARITY_NONE: No parity
							   - UART_PARITY_ODD: Odd parity
							   - UART_PARITY_EVEN: Even parity
							   - UART_PARITY_SP_1: Forced "1" stick parity
							   - UART_PARITY_SP_0: Forced "0" stick parity
							   */
  UART_DATABIT_Type Databits;   /**< Number of data bits, should be:
							   - UART_DATABIT_5: UART 5 bit data mode
							   - UART_DATABIT_6: UART 6 bit data mode
							   - UART_DATABIT_7: UART 7 bit data mode
							   - UART_DATABIT_8: UART 8 bit data mode
							   */
  UART_STOPBIT_Type Stopbits;   /**< Number of stop bits, should be:
							   - UART_STOPBIT_1: UART 1 Stop Bits Select
							   - UART_STOPBIT_2: UART 2 Stop Bits Select
							   */
} UART_CFG_Type;

/********************************************************************//**
* @brief UART FIFO Configuration Structure definition
**********************************************************************/

typedef struct {
	FunctionalState FIFO_ResetRxBuf;	/**< Reset Rx FIFO command state , should be:
										 - ENABLE: Reset Rx FIFO in UART
										 - DISABLE: Do not reset Rx FIFO  in UART
										 */
	FunctionalState FIFO_ResetTxBuf;	/**< Reset Tx FIFO command state , should be:
										 - ENABLE: Reset Tx FIFO in UART
										 - DISABLE: Do not reset Tx FIFO  in UART
										 */
	//FunctionalState FIFO_DMAMode;		/**< DMA mode, should be:
	//									 - ENABLE: Enable DMA mode in UART
	//									 - DISABLE: Disable DMA mode in UART
	//									 */
	UART_FITO_LEVEL_Type FIFO_Level;	/**< Rx FIFO trigger level, should be:
										- UART_FIFO_TRGLEV0: UART FIFO trigger level 0: 1 character
										- UART_FIFO_TRGLEV1: UART FIFO trigger level 1: 4 character
										- UART_FIFO_TRGLEV2: UART FIFO trigger level 2: 8 character
										- UART_FIFO_TRGLEV3: UART FIFO trigger level 3: 14 character
										*/
} UART_FIFO_CFG_Type;


/********************************************************************//**
* @brief UART Full modem -  RS485 Control configuration type
**********************************************************************/
typedef struct {
	FunctionalState NormalMultiDropMode_State; /*!< Normal MultiDrop mode State:
													- ENABLE: Enable this function.
													- DISABLE: Disable this function. */
	FunctionalState Rx_State;					/*!< Receiver State:
													- ENABLE: Enable Receiver.
													- DISABLE: Disable Receiver. */
	FunctionalState AutoAddrDetect_State;		/*!< Auto Address Detect mode state:
												- ENABLE: ENABLE this function.
												- DISABLE: Disable this function. */
	FunctionalState AutoDirCtrl_State;			/*!< Auto Direction Control State:
												- ENABLE: Enable this function.
												- DISABLE: Disable this function. */
	UART_RS485_DIRCTRL_PIN_Type DirCtrlPin;		/*!< If direction control is enabled, state:
												- UART_RS485_DIRCTRL_RTS:
												pin RTS is used for direction control.
												- UART_RS485_DIRCTRL_DTR:
												pin DTR is used for direction control. */
	 SetState DirCtrlPol_Level;					/*!< Polarity of the direction control signal on
												the RTS (or DTR) pin:
												- RESET: The direction control pin will be driven
												to logic "0" when the transmitter has data to be sent.
												- SET: The direction control pin will be driven
												to logic "1" when the transmitter has data to be sent. */
	uint8_t MatchAddrValue;					/*!< address match value for RS-485/EIA-485 mode, 8-bit long */
	uint8_t DelayValue;						/*!< delay time is in periods of the baud clock, 8-bit long */
} UART_RS485_CTRLCFG_Type;


