swarnmani/fmtr/arm_cortex/example/NXP_LPC1114_MDK4.0/LPC111x_Lib/include/lpc11xx_uart.h
/* UART call-back function type definitions */
/** UART Receive Call-back function type */
typedef void (fnRxCbs_Type)(void);
/** UART Transmit Call-back function type */
typedef void (fnTxCbs_Type)(void);
/** UART Auto-Baudrate Call-back function type */
typedef void (fnABCbs_Type)(uint32_t bABIntType);
/** UART Error Call-back function type */
typedef void (fnErrCbs_Type)(uint8_t bError);
/** UART modem status interrupt callback type */
typedef void (fnModemCbs_Type)(uint8_t ModemStatus);


/**
 * @}
 */


/* Public Macros -------------------------------------------------------------- */
/** @defgroup UART_Public_Macros
 * @{
 */


/* Macro to determine if it is valid UART port number */
#define PARAM_UARTx(x)	((uint32_t *)x)==((uint32_t *)LPC_UART)
#define PARAM_UART_MODEM(x) (((uint32_t *)x)==((uint32_t *)LPC_UART))


/** Macro to check the input value for UART_RS485_CFG_MATCHADDRVALUE parameter */
#define PARAM_UART_RS485_CFG_MATCHADDRVALUE(x) ((x<0xFF))

/** Macro to check the input value for UART_RS485_CFG_DELAYVALUE parameter */
#define PARAM_UART_RS485_CFG_DELAYVALUE(x) ((x<0xFF))


/** UART time-out definitions in case of using Read() and Write function
 * with Blocking Flag mode
 */

#define UART_BLOCKING_TIMEOUT			(0xFFFFFFFFUL)

/**
 * @}
 */


/* Public Functions ----------------------------------------------------------- */
/** @defgroup UART_Public_Functions
 * @{
 */

void UART_DeInit(UART_TypeDef* UARTx);
void UART_PinsInit(void);
void UART_ModePinsInit(void);
void UART_Init(UART_TypeDef *UARTx, UART_CFG_Type *UART_ConfigStruct);
void UART_ConfigStructInit(UART_CFG_Type *UART_InitStruct);
void UART_SendData(UART_TypeDef* UARTx, uint8_t Data);
uint8_t UART_ReceiveData(UART_TypeDef* UARTx);
void UART_ForceBreak(UART_TypeDef* UARTx);
void UART_IntConfig(UART_TypeDef *UARTx, UART_INT_Type UARTIntCfg, \
				FunctionalState NewState);
uint8_t UART_GetLineStatus(UART_TypeDef* UARTx);
FlagStatus UART_CheckBusy(UART_TypeDef *UARTx);
void UART_FIFOConfig(UART_TypeDef *UARTx, UART_FIFO_CFG_Type *FIFOCfg);
void UART_FIFOConfigStructInit(UART_FIFO_CFG_Type *UART_FIFOInitStruct);
void UART_ABCmd(UART_TypeDef *UARTx, UART_AB_CFG_Type *ABConfigStruct, \
				FunctionalState NewState);
void UART_TxCmd(UART_TypeDef *UARTx, FunctionalState NewState);
void UART_FullModemForcePinState(UART_TypeDef *UARTx, UART_MODEM_PIN_Type Pin, \
							UART_SignalState NewState);
void UART_FullModemConfigMode(UART_TypeDef *UARTx, UART_MODEM_MODE_Type Mode, \
							FunctionalState NewState);
uint8_t UART_FullModemGetStatus(UART_TypeDef *UARTx);
void UART_RS485Config(UART_TypeDef *UARTx, \
		UART_RS485_CTRLCFG_Type *RS485ConfigStruct);
void UART_RS485ReceiverCmd(UART_TypeDef *UARTx, FunctionalState NewState);
void UART_RS485SendSlvAddr(UART_TypeDef *UARTx, uint8_t SlvAddr);
uint32_t UART_RS485SendData(UART_TypeDef *UARTx, uint8_t *pData, uint32_t size);
uint32_t UART_Send(UART_TypeDef *UARTx, uint8_t *txbuf,
		uint32_t buflen, TRANSFER_BLOCK_Type flag);
uint32_t UART_Receive(UART_TypeDef *UARTx, uint8_t *rxbuf, \
		uint32_t buflen, TRANSFER_BLOCK_Type flag);
void UART_SetupCbs(UART_TypeDef *UARTx, uint8_t CbType, void *pfnCbs);
void UART_StdIntHandler(void);

/**
 * @}
 */


#ifdef __cplusplus
}
#endif


#endif /* __LPC11XX_UART_H */

/**
 * @}
 */

/* --------------------------------- End Of File ------------------------------ */
